# Есть фрагмент текста, состоящий из предложений. 
# Предложение - это строка, которая начинается с большой буквы и заканчивается точкой, вопросительным или восклицательным знаком (или несколькими такими знаками).
# Слова состоят только из латинских букв, разделяются отделяются пробелами или запятыми с пробелами.
# Предложение может состоять из одного слова.
# Составить предложение из первых слов предложений фрагмента. 
# Только первое слово итогового предложения должно быть с большой буквы, остальные с маленькой. 
# Предложение должно заканчиваться точкой.


def generate_sentence(text: str) -> str:
    pass
"Hello, cocroach. And where it is? Who, can do it?! Or vice versa!? Yes, it's difficult... Claro.." -> "Hello and who or yes claro."

"Hola..." -> Hola.